4ms/metamodule/firmware/lib/stm32-usb-host-lib/Class/CDC/Src/usbh_cdc.c
/**
  ******************************************************************************
  * @file    usbh_cdc.c
  * @author  MCD Application Team
  * @brief   This file is the CDC Layer Handlers for USB Host CDC class.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2015 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  *  @verbatim
  *
  *          ===================================================================
  *                                CDC Class Driver Description
  *          ===================================================================
  *           This driver manages the "Universal Serial Bus Class Definitions for Communications Devices
  *           Revision 1.2 November 16, 2007" and the sub-protocol specification of "Universal Serial Bus
  *           Communications Class Subclass Specification for PSTN Devices Revision 1.2 February 9, 2007"
  *           This driver implements the following aspects of the specification:
  *             - Device descriptor management
  *             - Configuration descriptor management
  *             - Enumeration as CDC device with 2 data endpoints (IN and OUT) and 1 command endpoint (IN)
  *             - Requests management (as described in section 6.2 in specification)
  *             - Abstract Control Model compliant
  *             - Union Functional collection (using 1 IN endpoint for control)
  *             - Data interface class
  *
  *  @endverbatim
  *
  ******************************************************************************
  */

/* BSPDependencies
- "stm32xxxxx_{eval}{discovery}{nucleo_144}.c"
- "stm32xxxxx_{eval}{discovery}_io.c"
- "stm32xxxxx_{eval}{discovery}{adafruit}_sd.c"
- "stm32xxxxx_{eval}{discovery}{adafruit}_lcd.c"
- "stm32xxxxx_{eval}{discovery}_sdram.c"
EndBSPDependencies */

/* Includes ------------------------------------------------------------------*/
#include "usbh_cdc.h"

/** @addtogroup USBH_LIB
  * @{
  */

/** @addtogroup USBH_CLASS
  * @{
  */

/** @addtogroup USBH_CDC_CLASS
  * @{
  */

/** @defgroup USBH_CDC_CORE
  * @brief    This file includes CDC Layer Handlers for USB Host CDC class.
  * @{
  */

/** @defgroup USBH_CDC_CORE_Private_TypesDefinitions
  * @{
  */
/**
  * @}
  */


/** @defgroup USBH_CDC_CORE_Private_Defines
  * @{
  */
#define USBH_CDC_BUFFER_SIZE                 1024
/**
  * @}
  */


/** @defgroup USBH_CDC_CORE_Private_Macros
  * @{
  */
/**
  * @}
  */


/** @defgroup USBH_CDC_CORE_Private_Variables
  * @{
  */
/**
  * @}
  */


/** @defgroup USBH_CDC_CORE_Private_FunctionPrototypes
  * @{
  */

static USBH_StatusTypeDef USBH_CDC_InterfaceInit(USBH_HandleTypeDef *phost);

static USBH_StatusTypeDef USBH_CDC_InterfaceDeInit(USBH_HandleTypeDef *phost);

static USBH_StatusTypeDef USBH_CDC_Process(USBH_HandleTypeDef *phost);

static USBH_StatusTypeDef USBH_CDC_SOFProcess(USBH_HandleTypeDef *phost);

static USBH_StatusTypeDef USBH_CDC_ClassRequest(USBH_HandleTypeDef *phost);

static USBH_StatusTypeDef GetLineCoding(USBH_HandleTypeDef *phost,
                                        CDC_LineCodingTypeDef *linecoding);

static USBH_StatusTypeDef SetLineCoding(USBH_HandleTypeDef *phost,
                                        CDC_LineCodingTypeDef *linecoding);

static void CDC_ProcessTransmission(USBH_HandleTypeDef *phost);

static void CDC_ProcessReception(USBH_HandleTypeDef *phost);

USBH_ClassTypeDef  CDC_Class =
{
  "CDC",
  USB_CDC_CLASS,
  USBH_CDC_InterfaceInit,
  USBH_CDC_InterfaceDeInit,
  USBH_CDC_ClassRequest,
  USBH_CDC_Process,
  USBH_CDC_SOFProcess,
  NULL,
};
/**
  * @}
  */


/** @defgroup USBH_CDC_CORE_Private_Functions
  * @{
  */

/**
  * @brief  USBH_CDC_InterfaceInit
  *         The function init the CDC class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_CDC_InterfaceInit(USBH_HandleTypeDef *phost)
{
  USBH_StatusTypeDef status;
  CDC_HandleTypeDef *CDC_Handle;
  uint8_t control_interface_num = 2;
  uint8_t data_interface_num = 3;

  // Explicitly use interface 2 for CDC Control
  // uint8_t interface = 2; // Original hardcoding
  USBH_UsrLog("CDC_Init: Using Interface %d for Control", control_interface_num);

  status = USBH_SelectInterface(phost, control_interface_num);
  if (status != USBH_OK)
  {
    USBH_ErrLog("CDC_Init: Failed to select interface %d", control_interface_num);
    return USBH_FAIL;
  }

  phost->pActiveClass->pData = (CDC_HandleTypeDef *)USBH_malloc(sizeof(CDC_HandleTypeDef));
  CDC_Handle = (CDC_HandleTypeDef *) phost->pActiveClass->pData;

  if (CDC_Handle == NULL)
  {
    USBH_ErrLog("CDC_Init: Cannot allocate memory for CDC Handle");
    return USBH_FAIL;
  }

  (void)USBH_memset(CDC_Handle, 0, sizeof(CDC_HandleTypeDef));

  // Use control_interface_num for Notification Endpoint setup
  if ((phost->device.CfgDesc.Itf_Desc[control_interface_num].Ep_Desc[0].bEndpointAddress & 0x80U) != 0U)
  {
    CDC_Handle->CommItf.NotifEp = phost->device.CfgDesc.Itf_Desc[control_interface_num].Ep_Desc[0].bEndpointAddress;
    CDC_Handle->CommItf.NotifEpSize  = phost->device.CfgDesc.Itf_Desc[control_interface_num].Ep_Desc[0].wMaxPacketSize;
  }
  else
  {
    USBH_ErrLog("CDC_Init: Notification endpoint on Itf %d is not an IN endpoint!", control_interface_num);
    CDC_Handle->CommItf.NotifEp = 0xFF; 
    CDC_Handle->CommItf.NotifEpSize = 0;
  }
  USBH_UsrLog("CDC_Init: NotifEp=0x%02X, NotifEpSize=%d from Interface %d", CDC_Handle->CommItf.NotifEp, CDC_Handle->CommItf.NotifEpSize, control_interface_num);

  CDC_Handle->CommItf.NotifPipe = USBH_AllocPipe(phost, CDC_Handle->CommItf.NotifEp);
  if (CDC_Handle->CommItf.NotifPipe == 0U)
  {
    USBH_ErrLog("CDC_Init: Failed to allocate NotifPipe for Ep 0x%02X", CDC_Handle->CommItf.NotifEp);
    USBH_free(phost->pActiveClass->pData);
    phost->pActiveClass->pData = NULL;
    return USBH_FAIL;
  }
  USBH_UsrLog("CDC_Init: NotifPipe=0x%02X", CDC_Handle->CommItf.NotifPipe);

  status = USBH_OpenPipe(phost, CDC_Handle->CommItf.NotifPipe, CDC_Handle->CommItf.NotifEp,
                      phost->device.address, phost->device.speed, USB_EP_TYPE_INTR,
                      CDC_Handle->CommItf.NotifEpSize);
  if (status != USBH_OK)
  {
    USBH_ErrLog("CDC_Init: Failed to open NotifPipe for Ep 0x%02X", CDC_Handle->CommItf.NotifEp);
    USBH_FreePipe(phost, CDC_Handle->CommItf.NotifPipe);
    USBH_free(phost->pActiveClass->pData);
    phost->pActiveClass->pData = NULL;
    return USBH_FAIL;
  }
  (void)USBH_LL_SetToggle(phost, CDC_Handle->CommItf.NotifPipe, 0U);

