4ms/metamodule/firmware/lib/stm32-usb-host-lib/Class/CDC/Src/usbh_cdc.c
  // Explicitly use interface 3 for CDC Data
  // interface = 3; // Original hardcoding
  USBH_UsrLog("CDC_Init: Using Interface %d for Data", data_interface_num);

  // Use data_interface_num for Data Endpoints setup
  if ((phost->device.CfgDesc.Itf_Desc[data_interface_num].Ep_Desc[0].bEndpointAddress & 0x80U) != 0U)
  {
    CDC_Handle->DataItf.InEp = phost->device.CfgDesc.Itf_Desc[data_interface_num].Ep_Desc[0].bEndpointAddress;
    CDC_Handle->DataItf.InEpSize  = phost->device.CfgDesc.Itf_Desc[data_interface_num].Ep_Desc[0].wMaxPacketSize;
  }
  else
  {
    CDC_Handle->DataItf.OutEp = phost->device.CfgDesc.Itf_Desc[data_interface_num].Ep_Desc[0].bEndpointAddress;
    CDC_Handle->DataItf.OutEpSize  = phost->device.CfgDesc.Itf_Desc[data_interface_num].Ep_Desc[0].wMaxPacketSize;
  }
  if ((phost->device.CfgDesc.Itf_Desc[data_interface_num].Ep_Desc[1].bEndpointAddress & 0x80U) != 0U)
  {
    CDC_Handle->DataItf.InEp = phost->device.CfgDesc.Itf_Desc[data_interface_num].Ep_Desc[1].bEndpointAddress;
    CDC_Handle->DataItf.InEpSize  = phost->device.CfgDesc.Itf_Desc[data_interface_num].Ep_Desc[1].wMaxPacketSize;
  }
  else
  {
    CDC_Handle->DataItf.OutEp = phost->device.CfgDesc.Itf_Desc[data_interface_num].Ep_Desc[1].bEndpointAddress;
    CDC_Handle->DataItf.OutEpSize = phost->device.CfgDesc.Itf_Desc[data_interface_num].Ep_Desc[1].wMaxPacketSize;
  }
  USBH_UsrLog("CDC_Init: DataItf InEp=0x%02X, InEpSize=%d, OutEp=0x%02X, OutEpSize=%d from Interface %d", 
              CDC_Handle->DataItf.InEp, CDC_Handle->DataItf.InEpSize, 
              CDC_Handle->DataItf.OutEp, CDC_Handle->DataItf.OutEpSize, data_interface_num);

  CDC_Handle->DataItf.OutPipe = USBH_AllocPipe(phost, CDC_Handle->DataItf.OutEp);
  if (CDC_Handle->DataItf.OutPipe == 0U)
  {
    USBH_ErrLog("CDC_Init: Failed to allocate OutPipe for Ep 0x%02X", CDC_Handle->DataItf.OutEp);
    USBH_ClosePipe(phost, CDC_Handle->CommItf.NotifPipe);
    USBH_FreePipe(phost, CDC_Handle->CommItf.NotifPipe);
    USBH_free(phost->pActiveClass->pData);
    phost->pActiveClass->pData = NULL;
    return USBH_FAIL;
  }
  USBH_UsrLog("CDC_Init: DataOutPipe=0x%02X", CDC_Handle->DataItf.OutPipe);

  CDC_Handle->DataItf.InPipe = USBH_AllocPipe(phost, CDC_Handle->DataItf.InEp);
  if (CDC_Handle->DataItf.InPipe == 0U)
  {
    USBH_ErrLog("CDC_Init: Failed to allocate InPipe for Ep 0x%02X", CDC_Handle->DataItf.InEp);
    USBH_ClosePipe(phost, CDC_Handle->DataItf.OutPipe);
    USBH_FreePipe(phost, CDC_Handle->DataItf.OutPipe);
    USBH_ClosePipe(phost, CDC_Handle->CommItf.NotifPipe);
    USBH_FreePipe(phost, CDC_Handle->CommItf.NotifPipe);
    USBH_free(phost->pActiveClass->pData);
    phost->pActiveClass->pData = NULL;
    return USBH_FAIL;
  }
  USBH_UsrLog("CDC_Init: DataInPipe=0x%02X", CDC_Handle->DataItf.InPipe);

  status = USBH_OpenPipe(phost, CDC_Handle->DataItf.OutPipe, CDC_Handle->DataItf.OutEp,
                      phost->device.address, phost->device.speed, USB_EP_TYPE_BULK,
                      CDC_Handle->DataItf.OutEpSize);
  if (status != USBH_OK)
  {
    USBH_ErrLog("CDC_Init: Failed to open OutPipe for Ep 0x%02X", CDC_Handle->DataItf.OutEp);
    USBH_FreePipe(phost, CDC_Handle->DataItf.InPipe);
    USBH_ClosePipe(phost, CDC_Handle->DataItf.OutPipe);
    USBH_FreePipe(phost, CDC_Handle->DataItf.OutPipe);
    USBH_ClosePipe(phost, CDC_Handle->CommItf.NotifPipe);
    USBH_FreePipe(phost, CDC_Handle->CommItf.NotifPipe);
    USBH_free(phost->pActiveClass->pData);
    phost->pActiveClass->pData = NULL;
    return USBH_FAIL;
  }

  status = USBH_OpenPipe(phost, CDC_Handle->DataItf.InPipe, CDC_Handle->DataItf.InEp,
                      phost->device.address, phost->device.speed, USB_EP_TYPE_BULK,
                      CDC_Handle->DataItf.InEpSize);
  if (status != USBH_OK)
  {
    USBH_ErrLog("CDC_Init: Failed to open InPipe for Ep 0x%02X", CDC_Handle->DataItf.InEp);
    USBH_ClosePipe(phost, CDC_Handle->DataItf.InPipe);
    USBH_FreePipe(phost, CDC_Handle->DataItf.InPipe);
    USBH_ClosePipe(phost, CDC_Handle->DataItf.OutPipe);
    USBH_FreePipe(phost, CDC_Handle->DataItf.OutPipe);
    USBH_ClosePipe(phost, CDC_Handle->CommItf.NotifPipe);
    USBH_FreePipe(phost, CDC_Handle->CommItf.NotifPipe);
    USBH_free(phost->pActiveClass->pData);
    phost->pActiveClass->pData = NULL;
    return USBH_FAIL;
  }

  CDC_Handle->state = CDC_IDLE_STATE;
  USBH_UsrLog("CDC_Init: Successfully initialized CDC Data Itf %d and Control Itf %d", data_interface_num, control_interface_num);

  (void)USBH_LL_SetToggle(phost, CDC_Handle->DataItf.OutPipe, 0U);
  (void)USBH_LL_SetToggle(phost, CDC_Handle->DataItf.InPipe, 0U);

  return USBH_OK;
}



/**
  * @brief  USBH_CDC_InterfaceDeInit
  *         The function DeInit the Pipes used for the CDC class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_CDC_InterfaceDeInit(USBH_HandleTypeDef *phost)
{
  CDC_HandleTypeDef *CDC_Handle = (CDC_HandleTypeDef *) phost->pActiveClass->pData;

  if ((CDC_Handle->CommItf.NotifPipe) != 0U)
  {
    (void)USBH_ClosePipe(phost, CDC_Handle->CommItf.NotifPipe);
    (void)USBH_FreePipe(phost, CDC_Handle->CommItf.NotifPipe);
    CDC_Handle->CommItf.NotifPipe = 0U;     /* Reset the Channel as Free */
  }

  if ((CDC_Handle->DataItf.InPipe) != 0U)
  {
    (void)USBH_ClosePipe(phost, CDC_Handle->DataItf.InPipe);
    (void)USBH_FreePipe(phost, CDC_Handle->DataItf.InPipe);
    CDC_Handle->DataItf.InPipe = 0U;     /* Reset the Channel as Free */
  }

  if ((CDC_Handle->DataItf.OutPipe) != 0U)
  {
    (void)USBH_ClosePipe(phost, CDC_Handle->DataItf.OutPipe);
    (void)USBH_FreePipe(phost, CDC_Handle->DataItf.OutPipe);
    CDC_Handle->DataItf.OutPipe = 0U;    /* Reset the Channel as Free */
  }

  if ((phost->pActiveClass->pData) != NULL)
  {
    USBH_free(phost->pActiveClass->pData);
    phost->pActiveClass->pData = 0U;
  }

  return USBH_OK;
}

/**
  * @brief  USBH_CDC_ClassRequest
  *         The function is responsible for handling Standard requests
  *         for CDC class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_CDC_ClassRequest(USBH_HandleTypeDef *phost)
{
  USBH_StatusTypeDef status;
  CDC_HandleTypeDef *CDC_Handle = (CDC_HandleTypeDef *) phost->pActiveClass->pData;

  /* Issue the get line coding request */
  status = GetLineCoding(phost, &CDC_Handle->LineCoding);
  if (status == USBH_OK)
  {
    phost->pUser(phost, HOST_USER_CLASS_ACTIVE);
  }
  else if (status == USBH_NOT_SUPPORTED)
  {
    USBH_ErrLog("Control error: CDC: Device Get Line Coding configuration failed");
  }
  else
  {
    /* .. */
  }

